Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2
The Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2 class is a helper class for managing
the association between Tekla.BIM.DirectManipulation.Services.Manipulators.Manipulator instances and the Tekla.Structures.Model.ModelObject instances that are being manipulated.
The equality of Tekla.Structures.Model.ModelObject instances is determined by the Tekla.Structures.DirectManipulation.Model.ObjectIdentifierEqualityComparer type.
The type of Tekla.Structures.Model.ModelObject that's being manipulated by the  type.
The type of Tekla.BIM.DirectManipulation.Services.Manipulators.Manipulator manipulating instances of the  type.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2.#ctor(Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService,System.Func{`0,`1})
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2 class.
manager: The Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService to attach the created manipulators to.
manipulatorCreator:
The method creating the new  instances, when required by
the ObjectManipulatorMap<TObject,TManipulator>.Update methods.
This method should not attach the created instances to any Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService instance.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2.#ctor(Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService,System.Func{`0,`1},System.Func{`0,System.Boolean})
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2 class.
manager: The Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService to attach the created manipulators to.
manipulatorCreator:
The method creating the new  instances, when required by
the ObjectManipulatorMap<TObject,TManipulator>.Update methods.
This method should not attach the created instances to any Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService instance.
predicate:
The method that defines a set of criteria for
and determines whether a  must be created for a .

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2.Update(`1,`0)
Updates the manipulator according to the new modelObject.
manipulator: The manipulator.
modelObject: The model object.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2.ValidateModelObject(`0)
Validates that the modelObject can be manipulated.
modelObject: The model object.
Returns: A value indicating whether the modelObject can be manipulated.